BAS BMEKZU Project/src/Documents/РегистрУчета/РегистрУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрУчета</name>
  <posting>Deny</posting>
  <attributes>
    <name>ВидРегистра</name>
    <type>
      <types>CatalogRef.ВидыРегистровУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСохраненияФайла</name>
    <type>
      <types>EnumRef.ФорматыСохраненияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/РегистрУчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	

	Если ДополнительныеСвойства.Свойство("ФайлРегистраУчета") Тогда
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Описание);
		
		ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
		НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("Ссылка", ФорматСохраненияФайла))[0];
		
		ДобавленныйФайл = ПрисоединенныеФайлы.ДобавитьФайл(
											Ссылка,
											ИмяФайла,
											НастройкиФормата.Расширение,
											Дата,
											Дата,
											ДополнительныеСвойства.ФайлРегистраУчета,
											,
											Описание
		);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ЭтотОбъект.Дата = ТекущаяДатаСеанса();
		ЭтотОбъект.ФорматСохраненияФайла = Документы.РегистрУчета.ПолучитьФорматСохраненияРегистров();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
